ohmyzsh/ohmyzsh

# ohmyzsh assumes that things in completions are auto loaded
ohmyzsh/ohmyzsh path:cache/completions kind:fpath

# git-escape-magic does an autoload, so it needs to add to the fpath first.
ohmyzsh/ohmyzsh path:plugins/git-escape-magic kind:fpath

ohmyzsh/ohmyzsh path:plugins/common-aliases
ohmyzsh/ohmyzsh path:plugins/cp
ohmyzsh/ohmyzsh path:plugins/dnf
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/gcloud
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/git-auto-fetch
ohmyzsh/ohmyzsh path:plugins/git-escape-magic
ohmyzsh/ohmyzsh path:plugins/git-prompt
ohmyzsh/ohmyzsh path:plugins/gitfast
ohmyzsh/ohmyzsh path:plugins/golang
ohmyzsh/ohmyzsh path:plugins/helm
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/mvn
ohmyzsh/ohmyzsh path:plugins/pep8
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/pyenv
ohmyzsh/ohmyzsh path:plugins/pylint
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/ripgrep
ohmyzsh/ohmyzsh path:plugins/rsync
ohmyzsh/ohmyzsh path:plugins/salt
ohmyzsh/ohmyzsh path:plugins/systemadmin
ohmyzsh/ohmyzsh path:plugins/systemd
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/ubuntu
ohmyzsh/ohmyzsh path:plugins/virtualenv
romkatv/powerlevel10k
zdharma-continuum/zsh-diff-so-fancy 
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-syntax-highlighting

# Must be at end of file
Aloxaf/fzf-tab

# But this has to be after fzf-tab...
ohmyzsh/ohmyzsh path:plugins/minikube

# and fzf itself also has to be after fzf-tab
ohmyzsh/ohmyzsh path:plugins/fzf
